# Brews
brew "bat"
brew "coreutils"
brew "fzf"
brew "git"
brew "heroku/brew/heroku"
brew "neovim"
brew "nodenv"
brew "postgresql", restart_service: true
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "watson"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Casks
cask "appcleaner"
cask "atom"
cask "brave-browser"
cask "dropbox"
cask "firefox"
cask "font-iosevka"
cask "iterm2"
cask "karabiner-elements"
cask "rectangle"
