# Taps
tap "puma/puma"

# Brews
brew "bat"
brew "cmus"
brew "coreutils"
brew "diff-so-fancy"
brew "elm"
brew "emojify"
brew "fzf"
brew "git"
brew "gnupg"
brew "heroku/brew/heroku"
brew "id3v2"
brew "inetutils"
brew "less"
brew "neovim"
brew "nodenv"
brew "openssl"
brew "pass"
brew "postgresql", restart_service: true
brew "puma/puma/puma-dev"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "translate-shell"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "watson"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Casks
cask "appcleaner"
cask "atom"
cask "brave-browser"
cask "dropbox"
cask "firefox"
cask "font-iosevka"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "rectangle"
cask "slack"
cask "vlc"

# Apps from App Store
mas "CopyClip", id: 595191960
mas "Pixelmator", id: 407963104
mas "The Archive Browser", id: 510232205
